EDT/УТ/src/InformationRegisters/ПараметрыКонтрагентов/ПараметрыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКонтрагентов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретСменыОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОжиданияПриЗабореТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВычисляемыйЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриёмИтогоСКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъёма</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретУстановкиСуммыПодъемаВодителюБольшеВыставленной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытиеЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВесЗапросаДанныхОПодъемеОтВодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОперативнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОперативнойПриемки</name>
    <type>
      <types>EnumRef.ТипыОперативнойПриемки</types>
    </type>
  </resources>
  <resources>
    <name>УчетЗаказовПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетШКПоТоварам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкладскаяОбработкаОтсутствует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АгрегироватьДанныеВОтправляемыхОтчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СвязкаНастройкиПечатиЧеков</name>
    <type>
      <types>CatalogRef.СвязкиККМ</types>
    </type>
  </resources>
  <resources>
    <name>СпособыКонтроляДнейЗадолженности</name>
    <type>
      <types>EnumRef.СпособыКонтроляДнейЗадолженности</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДоПросрочкиДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоАгрегатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Спецсчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОтношенийСКлиентами</name>
    <type>
      <types>EnumRef.ВариантыПечатиОтчетовАгента</types>
    </type>
  </resources>
  <resources>
    <name>setiingId_Strizh</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>login_Strizh</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>password_Strizh</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетТоваровПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечатьПредоплаченныхЧеков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеИсключениеМестЗаказаПриПогрузкеВАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКодИдентификацииКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НазначениеКодаИдентификацииКлиентаИССтрижа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеИсключениеЧастичноПринятыхНаСкладЗаказовПриПогрузкеВАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеСоздаватьМестаЗаказовПоПриходнымАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьКоличествоМестЗаказовПриВыгрузкеАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОдинаковыеШКНаВсехМестахЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьПроверкуБНЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифПримерки</name>
    <type>
      <types>CatalogRef.ТарифыПримерка</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаСсылкиЛКПолучателяЗаказаНаEmail</name>
    <type>
      <types>EnumRef.ВариантыОтправкиСсылокЛКПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаСсылкиЛКПолучателяЗаказаSMS</name>
    <type>
      <types>EnumRef.ВариантыОтправкиСсылокЛКПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонSMSОтправкиСсылкиЛКПолучателяЗаказа</name>
    <type>
      <types>CatalogRef.ШаблоныСМСРассылок</types>
    </type>
  </resources>
  <resources>
    <name>СопроводительныеДокументыНаходятсяВКоробке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БезусловнаяПечатьБланковЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>accessKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛьготнаяКатегорияЭквайринга</name>
    <type>
      <types>CatalogRef.ЛьготныеКатегорииЭквайринга</types>
    </type>
  </resources>
  <resources>
    <name>ПроизводитьРассылкуКонтроляЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяФормированияАПП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОператорРассылки</name>
    <type>
      <types>CatalogRef.ОператорыСМСРассылки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/РассылкиКонтрагентов/РассылкиКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РассылкиКонтрагентов</name>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРассылки</name>
    <type>
      <types>EnumRef.ТипыРассылки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыРассылки/ТипыРассылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРассылки</name>
  <enumValues>
    <name>АдминистративнаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>БухгалтерскаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ТехническаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>СкладскаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ЛогистическаяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ФинансоваяРассылка</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаЗаказов</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаАктовПриемаПередачи</name>
  </enumValues>
  <enumValues>
    <name>ЗаборнаяЛогистика</name>
  </enumValues>
  <enumValues>
    <name>КонтрольЗаказов</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/CommonModules/ОтправкаОтчетовСервер/Module.bsl
//Асеев 12.05.2023 (по письму Контроль заказов)>>>
Процедура РассылкаКонтрольЗаказов(ДанныеЗаказаВодителя, Рейс, Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РассылкиКонтрагентов.Почта КАК Почта
	|ИЗ
	|	РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК ПараметрыКонтрагентовСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РассылкиКонтрагентов КАК РассылкиКонтрагентов
	|		ПО (ПараметрыКонтрагентовСрезПоследних.ПроизводитьРассылкуКонтроляЗаказов)
	|			И (РассылкиКонтрагентов.Контрагент = &Контрагент)
	|			И (РассылкиКонтрагентов.ТипРассылки = ЗНАЧЕНИЕ(Перечисление.ТипыРассылки.КонтрольЗаказов))
	|			И (РассылкиКонтрагентов.Почта ПОДОБНО ""%@%"")
	|			И (РассылкиКонтрагентов.Активна)";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	МассивПолучателей = Результат.Выгрузить().ВыгрузитьКолонку("Почта");
	
	lem.РассылкаПоПереносуДоставки(МассивПолучателей, ДанныеЗаказаВодителя, Рейс);
	
КонецПроцедуры
//Асеев 12.05.2023 (по письму Контроль заказов)<<<

Функция ЧасыССотымиВЧасыСМинутами(Знач ЧасыССотыми) Экспорт
	
	Часы = Цел(ЧасыССотыми);
	Возврат Строка(Часы) + ":" + Формат((ЧасыССотыми - Часы) * 60, "ЧЦ=2; ЧН=; ЧВН=");
	
КонецФункции
